{
  "url": "https://www.hitched.co.uk/wedding-venues/the-oak-tree-of-peover_6313.htm",
  "description": "The Oak Tree is an independent wedding venue located just outside Knutsford, Cheshire. The contemporary oak-framed building was thoughtfully designed to blend seamlessly with its stunning natural surroundings.\nNestled within 30 acres of picturesque gardens and wild meadows, The Oak Tree offers a peaceful retreat for you and your guests to fully immerse yourselves in the beauty of the countryside. The remote location provides a serene atmosphere, whilst offering a breathtaking backdrop for your special day.\nThe bespoke venue features floor-to-ceiling windows that bathe each room in natural light, creating an inviting atmosphere. Inside and out, the space is adorned with twinkling fairy lights. Lush bougainvillea foliage spirals elegantly toward the ceiling throughout the venue, setting a romantic and enchanting scene.\nThe Venue\nOur venue is fully licensed for Civil Ceremonies in three beautiful locations: the Ladybird Room, the Acorn Room, and our charming Outdoor Pavilion. Each setting offers its own unique ambiance. What truly sets The Oak Tree apart is its inherent beauty. Adorned with lights and lush foliage, each space already exudes charm, requiring minimal additional decoration. The soft glow of the lights and the natural greenery create a magical atmosphere. The Outdoor Pavilion is nestled among lush trees and vibrant greenery, providing a peaceful and picturesque backdrop for your vows. Imagine exchanging your \"I do's\" under a canopy of branches, surrounded by natural beauty—it's a truly unforgettable experience.\nAfter your ceremony, our versatile venue allows you to tailor the space to perfectly suit your guest numbers and preferences. Whether you're hosting an intimate wedding breakfast or a lively evening reception, the choice of rooms ensures a seamless transition to accommodate every aspect of your celebration. Our dedicated team will handle all the details, ensuring a smooth and effortless flow from ceremony to reception, so you can relax and enjoy your special day to the fullest.\nFood & Drink\nWe are proud to partner with a selection of carefully chosen approved caterers who each bring their own distinct style and expertise. Whether you envision a formal sit-down dinner, a relaxed buffet, or something entirely unique, we work closely with our catering partners to ensure that your specific tastes and preferences are perfectly matched. This allows us to create a memorable dining experience tailored to your wedding day, leaving you confident that every detail will be handled with care and professionalism. Our Acorn Bar boasts a diverse selection of wines, spirits, beers, and cocktails, with emphasis on sourcing local and British brands that prioritize environmental responsibility. We take pride in offering high-quality, eco-conscious options while providing a personalized touch. Our team works closely with couples to create tailored drinks packages, ensuring that your beverage choices perfectly complement your special day and reflect your unique preferences.\nGrounds & Photo Opportunities\nWith our stunning Cheshire countryside setting, you're spoiled for choice when it comes to photo opportunities. Explore our beautifully manicured lawns, charming landscapes, and the enchanting wilderness meadow, which offers the perfect backdrop for capturing those magical golden hour sunset moments. Every corner of our grounds provides a picturesque setting to create unforgettable moments.\nSpecial Features\nIdeal for any season, couples can cozy up by our real open fire during the colder months, while our outdoor fire pit tables provide warmth and ambiance year-round.\nWe offer two onsite rooms for both partners to prepare on the morning of your wedding. Both provide comfy seating and plenty of mirrors, designed to make your pre-wedding experience comfortable and stress-free, whilst allowing you to focus on the excitement of the day ahead.\nOur venue is proudly dog-friendly, welcoming your furry friends to be part of your special day. So, feel free to bring along your four-legged companion and make your wedding day even more memorable!\nOur passionate and enthusiastic team of event coordinators are at-hand throughout the entire planning process- right from your first viewing through to your big day.",
  "address_full": "The Oak Tree of Peover WA169SG Knutsford (Cheshire)",
  "map_embed_url": null,
  "photo_count": 39,
  "venue_type_tags": [
    "In the country",
    "Unusual weddings",
    "Marquees and tents",
    "Woodland and festival",
    "Barn",
    "Outdoor license",
    "Tipis and yurts",
    "Unique weddings"
  ],
  "dining_options": [
    "Seated meal facilities",
    "Alcohol licence",
    "Buffet meal facilities",
    "In-house catering"
  ],
  "ceremony_options": [
    "Civil ceremony licence"
  ],
  "entertainment_options": [
    "Dance floor",
    "Entertainment licence",
    "Live band facilities",
    "Evening reception facilities",
    "DJ facilities",
    "Outdoor fireworks permitted"
  ],
  "social_links": [
    "https://www.facebook.com/barnvenue/",
    "https://www.instagram.com/theoaktreeofpeover/?hl=en"
  ],
  "preferred_suppliers": []
}